// Завдання 1: Дано масив, використовуючи цикл "for in" виведіть на консоль всі індекси цього масиву
function printIndexes(array) {
    // Проходимося по всіх індексах масиву
    // Виводимо кожен індекс на консоль
}

console.log("Завдання 1 ====================================");
printIndexes([1, 2, 3, 4, 5]);
// Виведе
// 0
// 1
// 2
// 3
// 4

// Завдання 2: Дано масив, використовуючи цикл "for in" знайдіть суму всіх елементів масиву
function sumArray(array) {
    // Ініціалізуємо змінну для зберігання суми
    // Проходимося по всіх індексах масиву
    // Додаємо кожен елемент до загальної суми
    // Повертаємо суму
}

console.log("Завдання 2 ====================================");
console.log("sumArray([1, 2, 3, 4, 5])", sumArray([1, 2, 3, 4, 5])); // Виведе 15

// Завдання 3: Дано масив, використовуючи цикл "for of" знайдіть добуток всіх елементів масиву
function multiplyArray(array) {
    // Ініціалізуємо змінну для зберігання добутку
    // Проходимося по всіх значеннях масиву
    // Множимо кожен елемент на загальний добуток
    // Повертаємо добуток
}

console.log("Завдання 3 ====================================");
console.log("multiplyArray([1, 2, 3, 4, 5])", multiplyArray([1, 2, 3, 4, 5])); // Виведе 120

// Завдання 4: Дано масив рядків. Видаліть третій елемент масиву та перетворіть в рядок за допомогою методу toString(). Результат виведіть на консоль.
function modifyArray(array) {
    // Видаляємо третій елемент масиву
    // Виводимо масив перетворений в рядок
}

console.log("Завдання 4 ====================================");
modifyArray([1, "two", 3, "four", 5]); // Виведе 1,two,,four,5

// Завдання 5: Дано масив рядків. За допомогою циклу for переберіть масив, виведіть кожен елемент на консоль у верхньому регістрі.
function printUppercase(array) {
    // Проходимося по всіх елементах масиву
    // Перетворюємо кожен елемент в верхній регістр та виводимо на консоль
}

console.log("Завдання 5 ====================================");
printUppercase(["one", "two", "three"]); // Виведе ONE TWO THREE

// Завдання 6: Функція приймає деструктуризований масив чисел де буду перший елемент та масив всіх інших.
// За допомогою циклу for переберіть масив, знайдіть мінімальне та максимальне значення. Результат виведіть на консоль.
function findMinMax([firstElement, ...restElements]) {
    // Ініціалізуємо змінні для мінімального та максимального значень, задаємо їм перше значення масиву
    // Перебираємо масив починаючи з другого елементу
    // Перевіряємо, чи поточний елемент менший за мінімальне значення
    // Якщо так, оновлюємо мінімальне значення
    // Перевіряємо, чи поточний елемент більший за максимальне значення
    // Якщо так, оновлюємо максимальне значення
    // Виводимо мінімальне та максимальне значення
}

console.log("Завдання 6 ====================================");
findMinMax([5, 2, 8, 1, 9, 3]); // Виведе Min: 1 Max: 9

// Завдання 7: Функція приймає масив рядків.
// Перетворіть масив в рядок за допомогою методу toString() та повторіть його 2 рази. Результат виведіть на консоль.
function printStrings(array) {
    // Перетворюємо масив в рядок і видаляемо пробіли та виводимо його на консоль
}

console.log("Завдання 7 ====================================");
printStrings([1, "two", 3, "four", 5]); // 1,two,3,four,51,two,3,four,5

// Завдання 8: Функція приймає масив рядків.
// За допомогою методу toString() перетворіть масив в рядок, та виясніть чи є в цьому рядку підрядок subString .

function concatenateStrings(array, subString) {
    // Використовуємо метод toString() для перетворення масиву в рядок
    //Перевіряємо чи містить рядок підрядок
    // Виводимо результат
}

console.log("Завдання 8 ====================================");
concatenateStrings([1, "two", 3, "four", 5], "two"); // Виведе true

// Завдання 9: Функція приймає масив чисел.
// За допомогою циклу for-in переберіть масив, додайте до кожного елемента 10.
// Зберігайте результат в новому масиві. Результат виведіть на консоль.
function addTenToEach(array) {
    // Ініціалізуємо масив через конструктор з такою же кількістю елементів як в вхідному масиві для зберігання результату
    // Перебираємо масив за допомогою циклу for-in
    // Додаємо до поточного елемента 10 та додаємо результат в новий масив
    // Виводимо результат
}

console.log("Завдання 9 ====================================");
addTenToEach([5, 10, 15, 20]); // Виведе [15, 20, 25, 30]

function swapMinMax(array) {
    let min = array[0];
    let max = array[0];
    let maxIndex = 0;
    let minIndex = 0;

    for (let i = 0; i < array.length; i++) {
        if (array[i] > max) {
            max = array[i];
            maxIndex = i;
        } else if (array[i] < min) {
            min = array[i];
            minIndex = i;
        }
    }

    [array[minIndex], array[maxIndex]] = [array[maxIndex], array[minIndex]]; // Деструктуризація для обміну місцями мінімального та максимального значень в масиві.
    return array;
}

console.log("Завдання 10 ====================================");
console.log(swapMinMax([1, 2, 3, 4, 5])); // Результат: [5, 2, 3, 4, 1]

// Завдання 11: Функція приймає масив чисел. Поверніть новий масив, який містить тільки парні числа з оригінального масиву.
function getEvenNumbers(arr) {
    let pust = []; // Створюємо пустий масив для зберігання результату
    for (let point of arr) {
        if (point % 2 === 0) {
            pust.push(point); // Додавання парного числа до масиву
        }
    }
    return pust; // Повертаємо масив результату
}

console.log("Завдання 11 ====================================");
console.log(getEvenNumbers([1, 2, 3, 4, 5, 6])); // Виведе [2, 4, 6]

function multiplyByIndex(arr) {
    let pust = []; // Створюємо пустий масив для зберігання результату
    for (let i = 0; i < arr.length; i++) {
        pust.push(arr[i] * i); // Множимо число на його індекс і додаємо до масиву результату
    }
    return pust; // Повертаємо масив результату
}

console.log("Завдання 12 ====================================");
console.log(multiplyByIndex([1, 2, 3, 4, 5])); // Виведе [0, 2, 6, 12, 20]


function replaceNumbers(arr) {
    let pust = []; // Створюємо пустий масив для зберігання результату
    for (let point of arr) {
        if (point > 10) {
            pust.push("Greater than 10");
        } else {
            pust.push("Less than or equal to 10");
        }
    }
    return pust; // Повертаємо масив результату
}

console.log("Завдання 13 ====================================");
console.log(replaceNumbers([5, 10, 15, 20])); // Виведе ["Less than or equal to 10", "Less than or equal to 10", "Greater than 10", "Greater than 10"]

